# TooManyElementsInSketch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..TooManyElementsInSketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
This sketch is large. Performance will improve if constructed as several independent sketches.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooManyElementsInSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooManyElementsInSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooManyElementsInSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace